# -*- mode: org; fill-column: 79 -*-

#+title: Python the Language
#+subtitle: Version {{{version}}} {{{time(%F %R)}}}
#+author: WLHarvey4
#+date:2019-07-04 11:25
#+macro: version 0.4.6

#+name:import-hello-and-this
#+header: :results output :exports results
#+begin_src python
import __hello__
import this
#+end_src

** Membership
   Python’s membership operators test for membership in a sequence, such as
   strings, lists, or tuples.  ~x in s~ evaluates to ~True~ if ~x~ is a /member/
   of ~s~, and ~False~ otherwise.  ~x not in s~ returns the negation of ~x in s~.
   - in :: Evaluates to true if it finds a variable in the specified
           sequence and false otherwise.
   - not in :: Evaluates to true if it does not finds a variable in
               the specified sequence and false otherwise.

   All built-in sequences and set types support this as well as dictionary, for
   which in tests whether the dictionary has a given key.

   For container types such as ~list~, ~tuple~, ~set~, ~frozenset~, ~dict~, or
   ~collections.deque~, the expression ~x in y~ is equivalent to ~any(x is e or x
   == e for e in y)~.

   For the string and bytes types, ~x in y~ is ~True~ if and only if ~x~ is a substring
   of ~y~.

   For user-defined classes which define the ~__contains__()~ method, ~x in y~
   returns ~True~ if ~y.__contains__(x)~ returns a true value, and ~False~
   otherwise.

   For user-defined classes which do not define ~__contains__()~ but do define
   ~__iter__()~, ~x in y~ is ~True~ if some value ~z~ with ~x == z~ is produced while
   iterating over ~y~.  If an exception is raised during the iteration, it is as if
   ~in~ raised that exception.

   Lastly, the old-style iteration protocol is tried: if a class defines
   ~__getitem__()~, ~x in y~ is ~True~ if and only if there is a non-negative
   integer index ~i~ such that ~x == y[i]~, and all lower integer indices do not
   raise ~IndexError~ exception.

   The operator ~not in~ is defined to have the inverse true value of ~in~.

   #+NAME: membership
   #+BEGIN_SRC python -n :results output :tangle membership.py :exports both :eval no-export

  a = 10
  b = 20
  list = [1, 2, 3, 4, 5 ];

  if ( a in list ):
     print ("Line 1 - a is available in the given list")
  else:
     print ("Line 1 - a is not available in the given list")

  if ( b not in list ):
     print ("Line 2 - b is not available in the given list")
  else:
     print ("Line 2 - b is available in the given list")

  a = 2
  if ( a in list ):
     print ("Line 3 - a is available in the given list")
  else:
     print ("Line 3 - a is not available in the given list")

   #+END_SRC

   #+RESULTS: membership
   : Line 1 - a is not available in the given list
   : Line 2 - b is not available in the given list
   : Line 3 - a is available in the given list
   : done

** Identity
   The operators ~is~ and ~is not~ test for object identity.  Object identity is
   determined using the ~id()~ function.

   Identity operators compare the memory locations of two objects.
   - is :: Evaluates to true if the variables on either side of the
           operator point to the same object and false otherwise.

           ~x is y~, here ~is~ results in 1 if ~id(x)~ equals ~id(y)~.

   - is not :: Evaluates to false if the variables on either side of
               the operator point to the same object and true
               otherwise.

               ~x is not y~, here ~is not~ results in 1 if ~id(x)~ is
               not equal to ~id(y)~.

   #+NAME: identity
   #+BEGIN_SRC python -n :results output :exports both :tangle identity.py :eval no-export

#!/usr/bin/python3

a = 20
b = 20

if ( a is b ):
   print ("Line 1 - a and b have same identity")
else:
   print ("Line 1 - a and b do not have same identity")

if ( id(a) == id(b) ):
   print ("Line 2 - a and b have same identity")
else:
   print ("Line 2 - a and b do not have same identity")

b = 30
if ( a is b ):
   print ("Line 3 - a and b have same identity")
else:
   print ("Line 3 - a and b do not have same identity")

if ( a is not b ):
   print ("Line 4 - a and b do not have same identity")
else:
   print ("Line 4 - a and b have same identity")

   #+END_SRC

   #+RESULTS:
   : Line 1 - a and b have same identity
   : Line 2 - a and b have same identity
   : Line 3 - a and b do not have same identity
   : Line 4 - a and b do not have same identity

**** Destructuring in ~for~ Loops
#+cindex:@code{enumerate} function
#+cindex:@code{enumerate} object
#+cindex:iterable collection
#+cindex:tuple
The ~enumerate~ function takes an iterable collection as an argument and
returns an ~enumerate~ object containing a tuple for each item in the
collection.  Each tuple contains a counter value, which increments with each
iteration, along with a value from the provided collection.

#+cindex:@code{enumerate} syntax
The syntax for ~enumerate~ looks like this:

#+name:enumerate-syntax
#+header: :results output
#+begin_src python
example_list = ["A", "B", "C"]

for counter, letter in enumerate(example_list):
	print(counter, letter)
#+end_src

#+RESULTS: enumerate-syntax
: (0, 'A')
: (1, 'B')
: (2, 'C')

#+cindex:destructuring example
This is an example of destructuring: For each tuple in the ~enumerate~ object,
the first value gets assigned to ~counter~, and the second value is assigned to
~letter~.  It's possible to do this type of destructuring with as many values
as we like, and this is not limited to the ~enumerate~ function.

#+name:complex-destructuring
#+header: :results output
#+begin_src python
people = [
	("Bob", 42, "Mechanic"),
	("James", 24, "Artist"),
	("Harry", 32, "Lecturer")
]

for name, age, profession in people:
	print(f"Name: {name}, Age: {age}, Profession: {profession}")
#+end_src

#+RESULTS: complex-destructuring
: Name: Bob, Age: 42, Profession: Mechanic
: Name: James, Age: 24, Profession: Artist
: Name: Harry, Age: 32, Profession: Lecturer

**** Ignoring Values
To ignore a value, use =_= in place of a variable.  For example, if we take one
of the tuples from the the people list above, and we only care about the name
and profession, we can do the following:

#+name:ignoring-values
#+header: :results output
#+begin_src python
person = ("Bob", 42, "Mechanic")
name, _, profession = person

print(name, profession)  # Bob Mechanic
#+end_src

#+RESULTS: ignoring-values
: Bob Mechanic

This would also work just as well inside a loop, and can also be used when we
don't care about any of the values. An example might be when using range to
ensure a set number of iterations.

#+begin_src python
for _ in range(10):
	<do something>
#+end_src

